Quirkbot/QuirkbotArduinoHardware/avr/boards.txt
quirkbot.name=Quirkbot
quirkbot.vid.0=0x2886
quirkbot.pid.0=0xf004
quirkbot.vid.1=0xf055
quirkbot.pid.1=0x0001
quirkbot.vid.2=0xf055
quirkbot.pid.2=0x0666

quirkbot.upload.tool=avrdude
quirkbot.upload.protocol=avr109
quirkbot.upload.maximum_size=28672
quirkbot.upload.maximum_data_size=2560
quirkbot.upload.speed=57600
quirkbot.upload.disable_flushing=true
quirkbot.upload.use_1200bps_touch=true
quirkbot.upload.wait_for_upload_port=true

quirkbot.bootloader.tool=avrdude
quirkbot.bootloader.low_fuses=0xff
quirkbot.bootloader.high_fuses=0xd8
quirkbot.bootloader.extended_fuses=0xce
quirkbot.bootloader.file=caterina-quirkbot/Caterina-Quirkbot.hex
quirkbot.bootloader.unlock_bits=0x3F
quirkbot.bootloader.lock_bits=0x2F

quirkbot.build.mcu=atmega32u4
quirkbot.build.f_cpu=8000000L
quirkbot.build.vid=0x2886
quirkbot.build.pid=0xf004
quirkbot.build.usb_product="Quirkbot"
quirkbot.build.usb_manufacturer="Seeedstudio"
quirkbot.build.board=AVR_QUIRKBOT
quirkbot.build.core=arduino
quirkbot.build.variant=quirkbot
quirkbot.build.extra_flags={build.usb_flags}